Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གཙང་ཞིང་དྲི་ང་བ་དང་བྲལ་བ། འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ། སེམས་ཅན་རིན་པོ་ཆེ་དགའ་ལྡན་གྱི་ལྷའི་རིས་ནས་འཕོས་ཏེ།
en: How could the pure Bodhisattva, who is free from bad-smelling odors, superior to the entire world, a jewel among beings, transmigrate from the divine realm of the Heaven of Joy and remain for ten months in the foul-smelling human body inside his mother’s womb?”

source: ཡུམ་གྱི་ལྷུམས་མིའི་ལུས་དྲི་མི་ཞིམ་པར་བཞུགས་པར་གྱུར་སྙམ་པ་དང་། དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་བུད་མེད་ཀྱི་ལུས་ནི་སྨད་པ་ལགས་པ་དང་། འདོད་ཆགས་ལ་སྤྱོད་ཅེས་བགྱི་བའི་བར་དུ་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་ངོ་མཚར་ཆེ་ན།
en: Then at that time, by the power of the Buddha, venerable Ānanda said to the Blessed One, “O Blessed One, the Thus-Gone One has taught how the female body is inferior and enjoys desire. That was astonishing.

source: བཅོམ་ལྡན་འདས་དེ་བས་ཀྱང་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ། སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ། འདི་ལྟར་དགའ་ལྡན་གྱི་ལྷའི་རིས་ནས་འཕོས་ཏེ། ཡུམ་གྱི་ལྷུམས་མིའི་ལུས་སུ་གློ་གཡས་ཕྱོགས་སུ་བརྟེན་ཏེ་བཞུགས་སོ། །ཞེས་བགྱི་བ་འདི་ནི་རབ་ཏུའང་ངོ་མཚར་ཆེ་སྟེ།
en: But, Blessed One, it is even more astonishing that when you, who are superior to all worlds, were a bodhisattva in the past, you moved from the divine realm of the Heaven of Joy and entered your mother, remaining in a human body on the right side of the womb!

source: བཅོམ་ལྡན་འདས། སྔོན་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལྟར་མཛད་དོ་ཞེས་དེ་སྐད་དུ་སྨྲ་བར་ནི་བདག་ལ་སྤྲོ་བ་མ་མཆིས་སོ།
en: Blessed One, you have mentioned how it all happened, and yet it is simply beyond me!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱ་བ་གང་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་གནས་པའི་ཡོངས་སུ་སྤྱད་པར་གྱུར་པ་མཐོང་བར་འདོད་དམ།
en: The Blessed One asked, “Ānanda, would you like to see the jeweled structure that the Bodhisattva delighted in? The one that became the Bodhisattva’s delight as he stayed in his mother’s womb?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེའི་དུས་ནི་ད་ལགས་སོ། །
en: nanda replied, “Yes please,

source: བདེ་བར་གཤེགས་པ་དེའི་དུས་ནི་ད་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་དེ་བསྟན་ཏེ་མཐོང་ན་གློ་བ་དགའོ།
en: Blessed One, right away. Well-Gone One, now would be a perfect time!

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྣམ་པ་དེ་ལྟ་བུའི་མཚན་མ་མཛད་དེ།
en: If the Thus-Gone One should reveal the Bodhisattva’s delight, it would be a great pleasure to witness it.”

source: དེས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ། ཚངས་པ་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་དང་ལྷན་ཅིག་ཚངས་པའི་འཇིག་རྟེན་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: Then, through the Blessed One’s doing, Brahmā, lord of the Sahā World, disappeared from the Brahma Realm together with six million eight hundred thousand gods of that same realm.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱིན་ནས། དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཐལ་མོ་སྦྱར་ཏེ།
en: They all appeared in the presence of the Blessed One, where they prostrated at the feet of the Blessed One and circled him three times.

source: བཅོམ་ལྡན་འདས་ལ་འདུད་ཅིང་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Then Brahmā stood to one side, bowing to the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་བཞིན་དུ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ལ་བཀའ་སྩལ་པ། ཚངས་པ་ཁྱོད་ཀྱིས་སྔོན་ང་བྱང་ཆུབ་སེམས་དཔའར་གྱུར་ཅིང་མའི་རུམ་ན་ཟླ་བ་བཅུར་འདུག་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་བླངས་སམ།
en: Although the Blessed One knew already, he asked Brahmā, the lord of the Sahā world, “Brahmā, did you remove the structure that delighted me in the past when I was a bodhisattva and stayed for ten months in my mother’s womb?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ།
en: Brahmā replied, “Yes, Blessed One.

source: །བདེ་བར་གཤེགས་པ་དེ་དེ་ལྟ་ལགས་སོ།
en: Indeed, Well-Gone One.”

source: །བཀའ་སྩལ་པ། ཚངས་པ་ད་དེ་ག་ལ་ཡོད་སྟོན་ཅིག །
en: “Well, Brahmā,” the Blessed One inquired, “where is it now?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་ཚངས་པའི་འཇིག་རྟེན་ན་མཆིས་སོ། །
en: Brahmā responded, “Blessed One, it is in the Brahma realm.”

source: བཀའ་སྩལ་པ། ཚངས་པ་དེའི་ཕྱིར་ཟླ་བ་བཅུ་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་དེ་འདིར་ཁྱོད་ཀྱིས་སྟོན་ཅིག་དང་། ཇི་ཙམ་དུ་འདུས་བྱས་པ་ཤེས་པར་འགྱུར་རོ། །དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས།
en: “In that case, Brahmā,” directed the Blessed One, “fetch this structure that delighted me as a bodhisattva for ten months and show it to everyone so they can know how it was constructed.”

source: ཚངས་པ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་དེ་བླང་གིས་དེའི་བར་དུ་ཁྱེད་འཁོད་ཅིག །
en: Brahmā, lord of the Sahā World, now spoke to the gods of the Brahma realm, saying, “Please wait here until I bring the jeweled structure that delighted the Bodhisattva.”

source: དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་མི་སྣང་བར་གྱུར་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་ཚངས་པའི་འཇིག་རྟེན་དུ་ཕྱིན་ཏོ།
en: Then Brahmā, lord of the Sahā World, prostrated with his head at the feet of the Blessed One before disappearing from the presence of the Blessed One. In that very instant he reached the Brahma realm.

source: །དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་ལྷའི་བུ་ཚངས་པ་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: There he spoke these words to the god Subrahmā:

source: །གྲོགས་པོ་ཁྱོད་སོང་ལ་ཚངས་པའི་འཇིག་རྟེན་འདི་མན་ཆད་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་ཡན་ཆད་དུ་སྒྲ་སྒྲོགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་བཀུར་ན་ཁྱེད་ཀྱི་ནང་ནས་མཐོང་བར་སུ་དགའ་བ་མྱུར་དུ་ཤོག་ཤིག་ཅེས་སྒྲས་གོ་བར་གྱིས་ཤིག །
en: “Friend, go from this Brahma realm up to the Heaven of the Thirty-Three and tell them, ‘We are bringing the jeweled structure that delighted the Bodhisattva and we are taking it into the presence of the Blessed One. Those among you who would like to see it should come quickly!’ ”

source: དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས། ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་བླངས་ཏེ། ཚངས་པའི་གཞལ་མེད་ཁང་ཆེན་པོ་དཔག་ཚད་སུམ་བརྒྱ་པའི་སྟེང་དུ་བཞག་ནས།
en: Brahmā, lord of the Sahā World, together with 84 trillion gods, lifted the jeweled structure that had delighted the Bodhisattva and placed it atop a great mansion in the Brahma realm that was three hundred leagues high.

source: ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་ཀུན་ནས་བསྐོར་ཏེ། འཛམ་བུའི་གླིང་དུ་ཕབ་བོ།
en: Surrounded by all these many trillions of gods, he then descended back down to Jambudvīpa.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་འདུས་པ་ཆེན་པོར་གྱུར་ཏེ།
en: At that time there was a great gathering of gods from the desire realm who wished to serve the Bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་དེ་ཡང་ལྷའི་གོས་དང་། ལྷའི་ཕྲེང་བ་དང་། ལྷའི་སྤོས་དང་། ལྷའི་མེ་ཏོག་དང་། ལྷའི་རོལ་མོའི་དབྱངས་སྒྲ་དང་། ལྷའི་ལོངས་སྤྱོད་རྣམས་ཀྱིས་མངོན་པར་འདུས་བྱས་པར་གྱུར་ཅིང་ལྷ་དབང་ཆེ་བར་གྲགས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་བར་གྱུར་པ་ནི་འདི་ཙམ་སྟེ།
en: These gods further embellished the jeweled structure that had delighted the Bodhisattva, using divine fabrics, garlands, perfumes, flowers, music, and other divine delights. The most eminent among the gods all surrounded the structure.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་རྒྱ་མཚོ་ཆེན་པོའི་དབུས་སུ་འདུག་ནས་རྒྱང་རིང་པོ་ནས་གདོང་ཐལ་མོས་བསྐྱབས་ཏེ་མགོ་བྱོལ་ནས་བལྟས་ཀྱང་མཐོང་བར་མི་ནུས་སོ།
en: At the same time Śakra, lord of the gods, was standing far away on top of Mount Sumeru in the middle of the ocean. Shielding his face with his palm, he turned his head and stared out unblinking and completely transfixed, but he was unable to see the jeweled structure.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why was that?

source: ལྷའི་ནང་ན་ཚངས་པ་དག་ནི་མཐུ་ཆེ་བ་སྟེ། སུམ་ཅུ་རྩ་གསུམ་དང་། འཐབ་བྲལ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་དག་ཀྱང་དེ་དག་གི་དྲུང་ན་དམའ་བ་ཡིན་ན།
en: Among the gods, those of the Brahma realm have the greatest ability, and the gods in the Heaven of the Thirty-Three, the Heaven Free from Strife, the Heaven of Joy, the Heaven of Delighting in Emanations, and the Heaven of Making Use of Others’ Emanations are inferior in comparison to them.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: So what need is there to speak of Śakra, master of the gods?

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ། ལྷའི་རོལ་མོ་དབྱངས་སྒྲའི་སྒྲ་དེ་དག་ཞི་བར་མཛད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ཐོས་པ་ཙམ་གྱིས་འཛམ་བུའི་གླིང་གི་མི་རྣམས་མྱོ་མྱོ་པོར་འགྱུར་དུ་འོང་བའི་ཕྱིར་རོ།
en: At that moment the Blessed One quieted the divine music because the humans in Jambudvīpa would all go insane merely from hearing such music.

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་དྲུང་དུ་ལྷགས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷའི་དབང་པོ་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་འདི་བདག་ཅག་གིས་མཐོང་བར་མི་ནུས་ན་ཇི་ལྟར་བགྱི།
en: The Four Great Kings now came before Śakra, lord of the gods, and asked him, “Lord of the gods, what can we do? We are unable to see this jeweled structure that delighted the Bodhisattva.”

source: དེས་དེ་དག་ལ་སྨྲས་པ། གྲོགས་པོ་དག་ཁོ་བོས་ཀྱང་ཇི་ལྟར་བྱ།
en: “Friends, what can I do?” Śakra responded.

source: ཁོ་བོ་ཉིད་ཀྱིས་ཀྱང་མཐོང་བར་མི་ནུས་སོ།
en: “I also cannot see it right now.

source: །གྲོགས་པོ་དག་འོན་ཀྱང་དེ་ནི་ནམ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕུལ་བ་དེའི་ཚེ་མཐོང་གྲང་ངོ་།
en: Nevertheless, friends, when it is brought into the presence of the Blessed One, we should be able to see it.”

source: །དེ་དག་གིས་སྨྲས་པ། ལྷའི་དབང་པོ་དེ་བས་ན་ཅི་ནས་ཀྱང་མྱུར་དུ་མཐོང་བར་འགྱུར་བ་དེ་ལྟར་མཛད་དུ་གསོལ།
en: The Four Great Kings pleaded, “Lord of the gods, for that reason let us quickly do whatever is necessary to see it!”

source: སྨྲས་པ། གྲོགས་པོ་དག་ལྷའི་བུ་མངོན་པར་འཕགས་པ་མངོན་པར་འཕགས་པ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱིན་ཏེ། དགའ་བར་བྱ་བའི་ཚིག་བརྗོད་པར་གྱུར་གྱི་བར་དུ་སྡོད་ཅིག །
en: “Friends,” replied Śakra, “wait until the best of the superior gods come into the presence of the Blessed One and delight him.”

source: དེ་ནས་དེ་དག་ཕྱོགས་གཅིག་ཏུ་འཁོད་དེ་མགོ་བྱོལ་ནས་བཅོམ་ལྡན་འདས་ལོགས་སུ་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: Thus they stood aside, turned their heads, and gazed intently at the Blessed One.

source: །དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པར་བྱ་བ་རིན་པོ་ཆེ་བཀོད་པ་དེ་ཁྱེར་ཏེ། དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་ཕུལ་ལོ།
en: Suddenly Brahmā, lord of the Sahā World, arrived together with 84 trillion gods, carrying the jeweled structure that had delighted the Bodhisattva and bringing it in front of the Thus-Gone One.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་དེ་ནི་གཟུགས་བཟང་བ་མཛེས་པ་བལྟ་ན་སྡུག་པ་གྲུ་བཞི་ལྷམ་པ།
en: The jeweled structure that had delighted the Bodhisattva was finely shaped, exquisite and beautiful to behold.

source: ཀ་བ་བཞི་ཟུག་པ།
en: It was square in form and had four pillars.

source: སྟེང་ཁང་པ་བརྩེགས་པས་ལེགས་པར་བརྒྱན་པ་སྟེ། དེའི་ཚད་ནི་འཕང་དུ་འདི་ལྟ་སྟེ། དཔེར་ན་བྱིས་པ་བཙས་ནས་ཟླ་བ་དྲུག་ལོན་པ་ཙམ་མོ།
en: At the top was a beautifully adorned upper floor scaled to fit a six-month-old fetus.

source: །ཁང་པ་བརྩེགས་པ། དེའི་ནང་དུ་ཁྲི་བཤམས་པ་ནི་འདི་ལྟ་སྟེ་དཔེར་ན་བྱིས་པ་བཙས་ནས་ཟླ་བ་དྲུག་ལོན་པ་འདུག་པའི་སྟེགས་བུ་ཙམ་མོ།
en: Inside that upper chamber was a throne with a sitting area that was likewise scaled to fit a six-month-old fetus.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པར་བྱ་བ་རིན་པོ་ཆེ་བཀོད་པ་དེའི་ཁ་དོག་དང་དབྱིབས་ནི་འདི་ལྟ་བུ་སྟེ། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ན་དེའི་དབྱིབས་དང་ཁ་དོག་འདྲ་བ་གང་ཡང་མེད་དོ།
en: There is nothing whatsoever in the world, including the realms of gods and Brahma gods, that is similar in color and shape to the jeweled structure that delighted the Bodhisattva.

source: །ལྷ་རྣམས་ཀྱིས་དེ་མཐོང་ན་ཡང་མིག་འཁྲུགས་ཤིང་ངོ་མཚར་དུ་འགྱུར་རོ།
en: When the gods saw it, their eyes were dazzled and they were amazed.

source: །དེ་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་བཞག་ན་ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེ་སྟེ།
en: When it was placed in the presence of the Thus-Gone One, it gleamed, radiated heat, and shone brightly.

source: དཔེར་ན་མགར་བ་མཁས་པས་ཤིན་ཏུ་བཞུ་སྟེ། ལེགས་པར་སྦྱངས་ནས། དྲི་མའི་སྐྱོན་མེད་པར་བྱས་པའི་གསེར་བཞིན་དུ་ཁང་པ་བརྩེགས་པ་དེ་རྣམ་པར་མཛེས་སོ།
en: This multistoried structure was as resplendent as gold that has been smelted twice by an expert goldsmith so that it has become perfectly refined and free of any impurity.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་དེའི་ནང་དུ་ཁྲི་བཤམས་པ་ནི། བྱང་ཆུབ་སེམས་དཔའི་དུང་མགྲིན་མ་གཏོགས་པ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ན་དེའི་དབྱིབས་དང་། ཁ་དོག་འདྲ་བ་གང་ཡང་མེད་དོ།
en: Likewise nothing whatsoever in all the divine realms can compare to the size and shape of the throne inside the structure that had delighted the Bodhisattva, except perhaps the neck of the Bodhisattva, which resembles a conch in shape and color.

source: །ཚངས་པ་ཆེན་པོས་གོས་བགོས་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཁྲི་དེའི་དྲུང་ན་མཛེས་པར་མི་སྣང་སྟེ། འདི་ལྟ་སྟེ་དཔེར་ན། རླུང་དང་ཆར་གྱིས་བཏབ་པའི་ལ་བ་ནག་པོ་བཞིན་ནོ།
en: Even the garments worn by the great Brahmā lost their beauty in front of the Bodhisattva’s throne, causing them to resemble cast-off black blankets that have been beaten by wind and rain.

source: །ཁང་པ་བརྩེགས་པ་དེ་ནི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་ལས་བྱས་པ་སྟེ། དེའི་ཕྱེ་མ་ཞོ་གཅིག་ལའང་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱིས་རིན་དུ་མི་ཆོག་གོ།
en: The temple was made from uraga sandalwood, which is so precious that a single mote of its dust is equal in value to a thousand universes.

source: །ཁང་པ་བརྩེགས་པ་དེ་ནི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དེ་ལྟ་བུས་ཀུན་ནས་བསྐོར་བ་སྟེ།
en: Furthermore the temple was surrounded on all sides by more such uraga sandalwood.

source: ཁང་པ་བརྩེགས་པ་དེ་དང་འདྲ་བ་གཉིས་པ་གཅིག་ཀྱང་ཁང་པ་བརྩེགས་པ་དང་པོ་དེའི་ནང་ན་མ་ཆགས་མ་རེག་པར་འདུག་གོ།
en: Inside that temple hovered an identical second structure, which did not touch the first structure.

source: །ཁང་པ་བརྩེགས་པ་དེ་ཁོ་ན་དང་འདྲ་བ་གསུམ་པ་གཅིག་ཀྱང་ཁང་པ་བརྩེགས་པ་གཉིས་པ་དེའི་ནང་ན་མ་རེག་མ་ཆགས་པར་འདུག་གོ།
en: Inside this second temple hovered an identical third structure, which also did not touch the second structure.

source: །སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པ་གསུམ་པ་དེའི་ནང་དུ་ཁྲི་དེ་བཞག་སྟེ་གདན་བཏིང་ངོ་།
en: Within that third temple made of incense was a throne with cushions.

source: །ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དེའི་ཁ་དོག་ནི་རྣམ་པ་འདི་ལྟ་བུ་སྟེ། དཔེར་ན་བཻ་དཱུརྱ་སྔོན་པོ་རིགས་དམ་པ་དང་ལྡན་པ་བཞིན་ནོ།
en: The color of the uraga sandalwood was like the finest blue beryl.

source: །སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པ་དེའི་འཁོར་ན་མེ་ཏོག་ལྷའི་ལས་འདས་པ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མ་བསྐྱེད་པར་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་རྣམ་པར་སྨིན་པས་ཁང་པ་བརྩེགས་པ་དེར་སྐྱེའོ།
en: Around the temple of incense were all types of flowers that surpassed even those of the gods. They had not been planted there, but appeared solely because of the maturation of the Bodhisattva’s previous basic virtue.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ། རིན་པོ་ཆེ་བཀོད་པ་དེ་ནི་རྡོ་རྗེའི་རང་བཞིན་ཏེ། སྲ་ཞིང་བརྟན་ལ་མི་ཤིགས་པ་སྟེ།
en: That precious structure that delighted the Bodhisattva was like a diamond—solid, firm, and indestructible.

source: ཀ་ཙ་ལིན་དའི་གོས་ལྟར་རེག་ན་བདེ་བའོ།
en: Yet it was also pleasant to the touch, like kācilindika cloth.

source: །འདོད་པ་ན་སྤྱོད་པའི་ལྷ་རྣམས་ཀྱི་གནས་བཀོད་པ་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་དེར་ཀུན་ཏུ་སྣང་ངོ་།
en: Moreover, the precious structure that delighted the Bodhisattva clearly reflected all that is found within the abodes of the gods of the desire realm.

source: །གང་གི་ནུབ་མོ་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་དུ་འཇུག་པ་དེ་ཡི་ནུབ་མོ་འོག་གི་ཆུའི་ཕུང་པོ་ནས་བཟུང་སྟེ། ས་ཆེན་པོའི་རྔམས་དཔག་ཚད་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་བརྟོལ་ཏེ་པད་མ་བྱུང་བས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་འཕགས་སོ།
en: On the evening in which the Bodhisattva entered the womb, a lotus appeared from below the waters, piercing the earth and rising up six million eight hundred thousand leagues, as far as the Brahma realm.

source: །པད་མ་དེ་ནི་ཁ་ལོ་སྒྱུར་བ་སྐྱེས་བུའི་དམ་པ་དང་། ཚངས་པ་ཆེན་པོ་བརྒྱ་ཕྲག་བཅུའི་སྟོབས་ལ་དབང་བས་མཐོང་དུ་ཟད་ཀྱི་གཞན་སུས་ཀྱང་མཐོང་བ་མེད་དོ།
en: Only the best of charioteers and the great Brahmā, who is master of a thousand powers, were able to see that flower. To everyone else, it was invisible.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་སྙིང་ཁུ་དང་། སྙིང་པོ་དང་། བཅུད་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་པད་མ་ཆེན་པོ་དེ་ལ་ཟིལ་དངར་གྱི་ཐིགས་པར་ཆགས་ཏེ།
en: In that great lotus appeared a drop of nectar, which embodied the extracted essence and vitality of the entire great trichiliocosm.

source: འདུག་ནས་དེ་ཚངས་པ་ཆེན་པོས་བཻ་དཱུརྱའི་སྣོད་བཟང་པོས་བླངས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕུལ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་དེ་བླངས་ཏེ་ཚངས་པ་ཆེན་པོ་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་འཐུངས་པར་གྱུར་ཏོ།
en: The great Brahmā placed this drop into a beautiful vessel of beryl and offered it to the Bodhisattva. The Bodhisattva accepted the gift and, out of affection for the great Brahmā, he drank it.

source: །སྙིང་ཁུའི་ཐིགས་པ་དེ་འཐུངས་ན་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་མ་གཏོགས་པར་དེ་ཡང་དག་པར་བདེ་བར་ཞུ་བར་ནུས་པ་སེམས་ཅན་གྱི་ཁམས་ན་སེམས་ཅན་དེ་ལྟ་བུ་དེ་གང་ཡང་མེད་དོ།
en: Apart from a bodhisattva in his final existence, who has completed all the bodhisattva stages, no other being is able to digest such a drop of vital energy.

source: །ལས་གང་གི་རྣམ་པར་སྨིན་པས་སྙིང་ཁུའི་ཐིགས་པ་དེ་ལྟ་བུ་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡོད་པར་གྱུར་ཅེ་ན།
en: What were the previous actions that prepared the Bodhisattva for digesting this drop of vital energy?

source: བྱང་ཆུབ་སེམས་དཔས་སྔོན་ཡུན་རིང་པོར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པའི་ཚེ། སེམས་ཅན་ནད་པ་དག་ལ་སྨན་བྱིན་པ་དང་། སེམས་ཅན་བསམ་པ་ལ་རྟེན་པ་རྣམས་ཀྱི་བསམ་པ་ཡོངས་སུ་བསྐང་བ་དང་། སྐྱབས་སུ་འོངས་པ་རྣམས་ཡོངས་སུ་མ་བཏང་བ་དང་། རྟག་པར་མེ་ཏོག་གི་ཕུད་དང་། འབྲས་བུའི་ཕུད་དང་། རོའི་ཕུད་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་རྣམས་དང་། ཕ་དང་མ་ལ་ཕུལ་ཞིང་ཕྱིས་བདག་ཉིད་ཡོངས་སུ་སྤྱོད་སྤྱོད་པས་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཚངས་པ་ཆེན་པོ་ཟིལ་དངར་གྱི་ཐིགས་པ་དེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་འབུལ་ལོ།
en: When the Bodhisattva was practicing the conduct of a bodhisattva for extended periods in the past, he gave medicine to the sick, fulfilled the wishes of those who had aspirations, and never abandoned those who came to him for refuge. He always offered the finest flowers, the best fruits, and the most delicious foods first to the thus-gone ones, the memorials of the thus-gone ones, the saṅgha of hearers of the thus-gone ones, and his parents. Only then would he cater to his own needs. It was as a result of this activity that the great Brahmā offered the Bodhisattva this drop of nectar.

source: །ཁང་པ་བརྩེགས་པ་དེར་གནས་ཀྱི་ཁྱད་པར་དགའ་བ་དང་། རྩེད་མོ་དང་། ཕྲེང་བ་བརྒྱུས་པ་དང་ལྡན་པ་འཕགས་པ་འཕགས་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་དེར་བྱུང་བར་སྣང་ངོ་།
en: Within that temple all the most excellent and exquisite pleasures and amusements came together, manifesting due to the maturation of the Bodhisattva’s previous actions.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་དེར་གོས་སྟོང་ཕྲག་བརྒྱའི་རྒྱན་ཅེས་བྱ་བ་ཕྲུགས་ཅིག་བྱུང་སྟེ།
en: Moreover, within the precious structure that delighted the Bodhisattva, a set of garments appeared, known as the ornament of a hundred thousand.

source: དེའི་བྱུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་མ་གཏོགས་པར་སེམས་ཅན་གྱི་རིས་ན་སེམས་ཅན་དེ་ལྟ་བུ་དེ་གང་ཡང་མེད་དོ།
en: Apart from a bodhisattva in his final existence, no other being anywhere could ever receive such garments.

source: །གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་མཆོག་ཏུ་བྱ་བ་དམ་པ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁང་པ་བརྩེགས་པ་དེ་ནི་མེད་པ་གང་ཡང་མེད་དོ།། །།
en: In fact all possible sublime and perfect forms, sounds, smells, tastes, and textures were present within that peaked structure.

source: ཡོངས་སུ་སྤྱད་པར་བྱ་བ་ཁང་པ་བརྩེགས་པ་དེ་ནི་འདི་ལྟར་ཕྱི་ནང་ཤིན་ཏུ་ཡོངས་སུ་གྲུབ་པ། འདི་ལྟར་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པ་སྟེ། འདི་ལྟ་སྟེ་དཔེར་ན། ཡུལ་ཀ་ལིང་ཀ་ནས་བྱུང་བའི་དར་ལྟར་རེག་ན་བདེ་བའོ། །དེ་ཡང་འོལ་བྱིར་བསྟན་པར་ཟད་ཀྱི། དེ་ལ་དཔེ་མེད་དོ།
en: In this way the temple that delighted the Bodhisattva was completely perfect and finely constructed both inside and outside. It was also pleasant to touch, like silk from Kaliṅga. This is merely an example, for in reality nothing could compare to it.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་འདི་ནི་བསམས་པས་འགྲུབ་སྟེ།
en: Because of the previous aspirations of the Bodhisattva, his intentions were accomplished.

source: གདོན་མི་ཟ་བར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མིའི་འཇིག་རྟེན་དུ་སྐྱེ་བ་དང་། མངོན་པར་བྱུང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: It is the nature of things that a great bodhisattva is born into the human world.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། མ་གང་གི་རུམ་དུ་སྐྱེ་བར་འགྱུར་བ་དེའི་རུམ་གཡས་པར་ཁང་པ་བརྩེགས་པ་རིན་པོ་ཆེ་བཀོད་པ་དམ་པ་སྔར་མངོན་པར་འགྲུབ་ཅིང་།
en: Having renounced his home, he attains perfect and complete awakening and turns the wheel of Dharma. Yet before he enters his mother’s womb, a temple of precious materials is manifested on the right side of the mother’s womb.

source: ཕྱིས་བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་ནས་འཕོས་ཏེ་ཁང་པ་བརྩེགས་པ་དེར་སྐྱིལ་ཀྲུང་བཅས་ནས་འདུག་པར་འབྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པའི་ལུས་ནུར་ནུར་པོ་དང་། མེར་མེར་པོ་དང་། ལྟར་ལྟར་པོ་དང་། རེང་རེང་པོར་འགྱུར་བ་མེད་ཅིང་།
en: Then as a bodhisattva transmigrates from the Heaven of Joy, he remains seated in a cross-legged position in that tiered chamber. The body of a bodhisattva in his last existence is free from the four stages of embryonic development.

source: ཡན་ལག་དང་། ཉིང་ལག་དང་། མཚན་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་འདུག་བཞིན་དུ་འབྱུང་ལ།
en: Instead he appears seated, with all his limbs, organs, and characteristics fully formed.

source: ལྷ་མོ་སྒྱུ་འཕྲུལ་གྱི་རྨི་ལམ་དུ་གླང་པོ་ཆེན་པོ་འོངས་པར་མཐོང་བ་འདི་ནི་ཆོས་ཉིད་དོ།
en: As such Queen Māyā saw the arrival of an elephant in her dream.

source: །དེ་དེ་ལྟར་འདུག་པ་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་། གང་ལས་ལག་ན་རྡོ་རྗེ་སྐྱེས་པའི་གནོད་སྦྱིན་གྱི་རིགས་གསང་བ་པ་ཞེས་བྱ་བ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་དུ་ཞུགས་པར་ཤེས་ནས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ཕྱི་བཞིན་འབྲང་བར་གྱུར་ཏོ།
en: Now Śakra, lord of the gods, as well as the Four Great Kings, the twenty-eight great commanders of the yakṣas, and the master of the guhyakas, who are the type of yakṣa from which Vajrapāṇi came, all knew that the Bodhisattva had entered the womb of his mother, and they constantly stayed close to him.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལ་རིམ་གྲོ་བྱེད་པའི་ལྷ་མོ་བཞི་ཡོད་དེ། ཨུ་ཁུ་ལི་ཞེས་བྱ་བ་དང་། མུ་ཁུ་ལི་ཞེས་བྱ་བ་དང་། རྒྱལ་མཚན་ལྡན་པ་ཞེས་བྱ་བ་དང་། འོད་དང་ལྡན་པ་ཞེས་བྱ་བ་སྟེ།
en: The Bodhisattva also had four goddesses named Utkhalī, Samutkhalī, Dhvajavatī, and Prabhāvatī serve him.

source: བཞི་པོ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་དུ་ཞུགས་པར་ཤེས་ནས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སྲུང་ངོ་།
en: When these four goddesses knew that the Bodhisattva had entered the womb of his mother, they kept a constant guard over him.

source: །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཡང་ལྷའི་བུ་ལྔ་བརྒྱ་ཙམ་དང་ལྷན་ཅིག་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་དུ་ཞུགས་པ་ཤེས་ནས། རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ཕྱི་བཞིན་འབྲང་བར་གྱུར་ཏོ།
en: In addition, when Śakra, lord of the gods, discovered that the Bodhisattva had entered the womb of his mother, he brought along five hundred gods to constantly follow the Bodhisattva.

source: །བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་དུ་ཞུགས་པའི་ལུས་ནི་རྣམ་པ་འདི་ལྟ་བུར་གྱུར་ཏེ།
en: The body of a bodhisattva who has entered the womb of his mother develops certain features.

source: དཔེར་ན་མཚན་མོ་མུན་པ་ཤིན་ཏུ་གནག་པའི་ནང་ན་རིའི་སྤོ་ལ་མེའི་ཕུང་པོ་ཆེན་པོ་འདུག་པ་ནི་དཔག་ཚད་གཅིག་ནས་ཀྱང་སྣང་ངོ་། །དཔག་ཚད་ལྔའི་བར་ནས་ཀྱང་སྣང་ངོ་།
en: For example, it is like a great fire burning on a mountaintop during the darkest night, visible from a league or even five leagues away.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་དུ་ཞུགས་པའི་ལུས་མངོན་པར་གྲུབ་པ་ཡང་དེ་ལྟ་བུར་གྱུར་ཏེ།
en: The body of the Bodhisattva as he entered the womb of his mother was just this way.

source: འོད་གསལ་ཞིང་གཟུགས་བལ་མཛེས་ཤིང་བལྟ་ན་སྡུག་པར་གྱུར་པ་དེ།
en: It was radiant, well formed, handsome, and pleasing to see.
